# Лабораторная работа - Настройка NAT для IPv4

## Топология

![](Pic_1.png)

## Таблица адресации

<table>
    <thead>
        <tr>
            <th>Устройство</th>
            <th>Интерфейс/VLAN</th>
            <th>IP-адрес</th>
            <th>Маска подсети</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td rowspan=2 align="center">R1</td>
            <td align="center">G0/0/0</td>
            <td align="center">209.165.200.230</td>
            <td align="center">255.255.255.248</td>
        </tr>
        <tr>
            <td align="center">G0/0/1</td>
            <td align="center">192.168.1.1</td>
            <td align="center">255.255.255.0</td>
        </tr>
        <tr>
            <td rowspan=2 align="center">R2</td>
            <td align="center">G0/0/0</td>
            <td align="center">209.165.200.225</td>
            <td align="center">255.255.255.248</td>
        </tr>
        <tr>
            <td align="center">Lo1</td>
            <td align="center">209.165.200.1</td>
            <td align="center">255.255.255.224</td>
        </tr>
        <tr>
            <td align="center">S1</td>
            <td align="center">VLAN 1</td>
            <td align="center">192.168.1.11</td>
            <td align="center">255.255.255.0</td>
        </tr>
        <tr>
            <td align="center">S2</td>
            <td align="center">VLAN 1</td>
            <td align="center">192.168.1.12</td>
            <td align="center">255.255.255.0</td>
        </tr>
        <tr>
            <td align="center">PC-A</td>
            <td align="center">NIC</td>
            <td align="center">192.168.1.2</td>
            <td align="center">255.255.255.0</td>
        </tr>
        <tr>
            <td align="center">PC-B</td>
            <td align="center">NIC</td>
            <td align="center">192.168.1.3</td>
            <td align="center">255.255.255.0</td>
        </tr>
    </tbody>
</table>

## Создание сети и настройка основных параметров устройства.

### Базовая настройка маршрутизаторов.

Настройка выполнена скриптами. Для R1:

```
enable
configure terminal
hostname R1
no ip domain lookup
service password-encryption
enable secret class
line console 0
logging synchronous
password cisco
login
exit
line vty 0 4
logging synchronous
password cisco
login
exit
banner motd "Please login"
int g0/0/0
ip address 209.165.200.230 255.255.255.248
no shut
int g0/0/1
ip address 192.168.1.1 255.255.255.0
no shut
end
wr

```

Для R2:
```
enable
configure terminal
hostname R2
no ip domain lookup
service password-encryption
enable secret class
line console 0
logging synchronous
password cisco
login
exit
line vty 0 4
logging synchronous
password cisco
login
exit
banner motd "Please login"
int g0/0/0
ip address 209.165.200.225 255.255.255.248
no shut
int lo 1
ip address 209.165.200.1 255.255.255.224
no shut
end
wr

```

### Базовая настройка коммутаторов.
Настройка выполнена скриптами. Для S1:
```
enable
configure terminal
hostname S1
no ip domain lookup
service password-encryption
enable secret class
line console 0
logging synchronous
password cisco
login
exit
line vty 0 4
logging synchronous
password cisco
login
exit
banner motd "Please login"
int vlan 1
ip address 192.168.1.11 255.255.255.0
no shut
end
wr
```
Для S2:
```
enable
configure terminal
hostname S2
no ip domain lookup
service password-encryption
enable secret class
line console 0
logging synchronous
password cisco
login
exit
line vty 0 4
logging synchronous
password cisco
login
exit
banner motd "Please login"
int vlan 1
ip address 192.168.1.12 255.255.255.0
no shut
end
wr
```

## Настройка и проверка NAT для IPv4.

### Настройка NAT на R1, используя пул из трех адресов 209.165.200.226-209.165.200.228. 

Настроен простой список доступа, который определяет, какие хосты будут разрешены для трансляции. В этом случае все устройства в локальной сети R1 имеют право на трансляцию.
```
R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```

Создан пул NAT и ему назначено имя и диапазон используемых адресов.

```
R1(config)# ip nat pool PUBLIC_ACCESS 209.165.200.226 209.165.200.228 netmask 255.255.255.248 
```

Настроено преобразование, связывающее ACL и пул с процессом преобразования.

```
R1(config)# ip nat inside source list 1 pool PUBLIC_ACCESS
```

Задан внутренний (inside) интерфейс. 

```
R1(config)# interface g0/0/1
R1(config-if)# ip nat inside
```

Определен внешний (outside) интерфейс.

```
R1(config)# interface g0/0/0
R1(config-if)# ip nat outside
```

### Тестирование и проверка конфигурации.

```
R1#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:28192.168.1.3:28     209.165.200.1:28   209.165.200.1:28
icmp 209.165.200.226:29192.168.1.3:29     209.165.200.1:29   209.165.200.1:29
icmp 209.165.200.226:30192.168.1.3:30     209.165.200.1:30   209.165.200.1:30
icmp 209.165.200.226:31192.168.1.3:31     209.165.200.1:31   209.165.200.1:31
```

Вопросы.

Во что был транслирован внутренний локальный адрес PC-B?
```
209.165.200.226
```

Каким типом адреса NAT является преобразованный адрес?

```
Глобальным внутренним.
```

С PC-A выполнен  эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.
```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:1 192.168.1.2:1      209.165.200.1:1    209.165.200.1:1
icmp 209.165.200.226:2 192.168.1.2:2      209.165.200.1:2    209.165.200.1:2
icmp 209.165.200.226:3 192.168.1.2:3      209.165.200.1:3    209.165.200.1:3
icmp 209.165.200.226:4 192.168.1.2:4      209.165.200.1:4    209.165.200.1:4
```

C S1 выполнен эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.
```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:2 192.168.1.11:2     209.165.200.1:2    209.165.200.1:2
icmp 209.165.200.226:3 192.168.1.11:3     209.165.200.1:3    209.165.200.1:3
icmp 209.165.200.226:4 192.168.1.11:4     209.165.200.1:4    209.165.200.1:4
icmp 209.165.200.226:5 192.168.1.11:5     209.165.200.1:5    209.165.200.1:5
```

Следующий эхо-запрос с нового устройства завершается ошибкой так как для NAT выделено только три адреса и они уже заняты.

Очистим таблицу преобразования NAT.
```
R1# clear ip nat translation * 
R1# clear ip nat statistics  /Не поддерживается CPT.
```

## Настройка и проверка PAT для IPv4.

### Удаление команды преобразования на R1.

```
R1(config)# no ip nat inside source list 1 pool PUBLIC_ACCESS
```

### Добавление команды PAT на R1.

```
R1(config)# ip nat inside source list 1 pool PUBLIC_ACCESS overload 
```

### Тестирование и проверка конфигурации.

С PC-B выполнен эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.

```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:1 192.168.1.3:1      209.165.200.1:1    209.165.200.1:1
icmp 209.165.200.226:2 192.168.1.3:2      209.165.200.1:2    209.165.200.1:2
icmp 209.165.200.226:3 192.168.1.3:3      209.165.200.1:3    209.165.200.1:3
icmp 209.165.200.226:4 192.168.1.3:4      209.165.200.1:4    209.165.200.1:4
```

#### Вопросы.

Во что был транслирован внутренний локальный адрес PC-B?

```
209.165.200.226
```

Какой тип адреса NAT является переведенным адресом?

```
Внутренний глобальный.
```

Чем отличаются выходные данные команды show ip nat translations из упражнения NAT?

```
Практически ничем.
```

С PC-A выполнен эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.

```
R1#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:1 192.168.1.2:1      209.165.200.1:1    209.165.200.1:1
icmp 209.165.200.226:2 192.168.1.2:2      209.165.200.1:2    209.165.200.1:2
icmp 209.165.200.226:3 192.168.1.2:3      209.165.200.1:3    209.165.200.1:3
icmp 209.165.200.226:4 192.168.1.2:4      209.165.200.1:4    209.165.200.1:4
```

Отправьте ping еще раз, и быстро вернитесь к маршрутизатору и введите команду show ip nat translations verbose , и вы увидите, что произошло.

```
CPT не поддерживает команду show ip nat translations verbose
```

Cuенерируеv трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используя параметр -t с командой ping, запустим безостановочный ping на интерфейс Lo1 R2 (ping -t 209.165.200.1).

```
R1#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.226:1024192.168.1.2:9      209.165.200.1:9    209.165.200.1:1024
icmp 209.165.200.226:1025192.168.1.2:10     209.165.200.1:10   209.165.200.1:1025
icmp 209.165.200.226:1026192.168.1.2:11     209.165.200.1:11   209.165.200.1:1026
icmp 209.165.200.226:1027192.168.1.2:12     209.165.200.1:12   209.165.200.1:1027
icmp 209.165.200.226:1028192.168.1.2:13     209.165.200.1:13   209.165.200.1:1028
icmp 209.165.200.226:1029192.168.1.2:14     209.165.200.1:14   209.165.200.1:1029
icmp 209.165.200.226:1030192.168.1.2:15     209.165.200.1:15   209.165.200.1:1030
icmp 209.165.200.226:1031192.168.1.2:16     209.165.200.1:16   209.165.200.1:1031
icmp 209.165.200.226:1032192.168.1.2:17     209.165.200.1:17   209.165.200.1:1032
icmp 209.165.200.226:1033192.168.1.2:18     209.165.200.1:18   209.165.200.1:1033
icmp 209.165.200.226:1034192.168.1.2:19     209.165.200.1:19   209.165.200.1:1034
icmp 209.165.200.226:1035192.168.1.2:20     209.165.200.1:20   209.165.200.1:1035
icmp 209.165.200.226:1036192.168.1.2:21     209.165.200.1:21   209.165.200.1:1036
icmp 209.165.200.226:1037192.168.1.2:22     209.165.200.1:22   209.165.200.1:1037
icmp 209.165.200.226:1038192.168.1.2:23     209.165.200.1:23   209.165.200.1:1038
icmp 209.165.200.226:1039192.168.1.2:24     209.165.200.1:24   209.165.200.1:1039
icmp 209.165.200.226:1040192.168.1.2:25     209.165.200.1:25   209.165.200.1:1040
icmp 209.165.200.226:1041192.168.1.2:26     209.165.200.1:26   209.165.200.1:1041
icmp 209.165.200.226:1042192.168.1.2:27     209.165.200.1:27   209.165.200.1:1042
icmp 209.165.200.226:1043192.168.1.2:28     209.165.200.1:28   209.165.200.1:1043
icmp 209.165.200.226:1044192.168.1.2:29     209.165.200.1:29   209.165.200.1:1044
icmp 209.165.200.226:10192.168.1.3:10     209.165.200.1:10   209.165.200.1:10
icmp 209.165.200.226:11192.168.1.3:11     209.165.200.1:11   209.165.200.1:11
icmp 209.165.200.226:12192.168.1.3:12     209.165.200.1:12   209.165.200.1:12
icmp 209.165.200.226:13192.168.1.3:13     209.165.200.1:13   209.165.200.1:13
icmp 209.165.200.226:14192.168.1.3:14     209.165.200.1:14   209.165.200.1:14
icmp 209.165.200.226:15192.168.1.3:15     209.165.200.1:15   209.165.200.1:15
icmp 209.165.200.226:16192.168.1.3:16     209.165.200.1:16   209.165.200.1:16
icmp 209.165.200.226:17192.168.1.3:17     209.165.200.1:17   209.165.200.1:17
icmp 209.165.200.226:18192.168.1.3:18     209.165.200.1:18   209.165.200.1:18
icmp 209.165.200.226:19192.168.1.3:19     209.165.200.1:19   209.165.200.1:19
icmp 209.165.200.226:20192.168.1.3:20     209.165.200.1:20   209.165.200.1:20
icmp 209.165.200.226:21192.168.1.3:21     209.165.200.1:21   209.165.200.1:21
icmp 209.165.200.226:22192.168.1.3:22     209.165.200.1:22   209.165.200.1:22
icmp 209.165.200.226:23192.168.1.3:23     209.165.200.1:23   209.165.200.1:23
icmp 209.165.200.226:24192.168.1.3:24     209.165.200.1:24   209.165.200.1:24
icmp 209.165.200.226:25192.168.1.3:25     209.165.200.1:25   209.165.200.1:25
icmp 209.165.200.226:26192.168.1.3:26     209.165.200.1:26   209.165.200.1:26
icmp 209.165.200.226:27192.168.1.3:27     209.165.200.1:27   209.165.200.1:27
icmp 209.165.200.226:28192.168.1.3:28     209.165.200.1:28   209.165.200.1:28
icmp 209.165.200.226:29192.168.1.3:29     209.165.200.1:29   209.165.200.1:29
icmp 209.165.200.226:30192.168.1.3:30     209.165.200.1:30   209.165.200.1:30
icmp 209.165.200.226:31192.168.1.3:31     209.165.200.1:31   209.165.200.1:31
icmp 209.165.200.226:32192.168.1.3:32     209.165.200.1:32   209.165.200.1:32
icmp 209.165.200.226:33192.168.1.3:33     209.165.200.1:33   209.165.200.1:33
icmp 209.165.200.226:34192.168.1.3:34     209.165.200.1:34   209.165.200.1:34
icmp 209.165.200.226:35192.168.1.3:35     209.165.200.1:35   209.165.200.1:35
icmp 209.165.200.226:36192.168.1.3:36     209.165.200.1:36   209.165.200.1:36
icmp 209.165.200.226:37192.168.1.3:37     209.165.200.1:37   209.165.200.1:37
icmp 209.165.200.226:38192.168.1.3:38     209.165.200.1:38   209.165.200.1:38
icmp 209.165.200.226:9 192.168.1.3:9      209.165.200.1:9    209.165.200.1:9
```

Как маршрутизатор отслеживает, куда идут ответы?
С помощью назначения разных портов для каждого запроса.

Очистим трансляцию адресов.

```
R1# clear ip nat translation * 
R1# clear ip nat statistic
```

### Удаление команды преобразования nat pool на R1.

```
R1(config)# no ip nat inside source list 1 pool PUBLIC_ACCESS overload 
R1(config)# no ip nat pool PUBLIC_ACCESS
```

### Добавление команды PAT overload, указав внешний интерфейс.

```
R1(config)# ip nat inside source list 1 interface g0/0/0 overload
```

### Тестирование и проверка конфигурации.

С PC-B выполнен эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.

```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.230:233192.168.1.3:233    209.165.200.1:233  209.165.200.1:233
icmp 209.165.200.230:234192.168.1.3:234    209.165.200.1:234  209.165.200.1:234
icmp 209.165.200.230:235192.168.1.3:235    209.165.200.1:235  209.165.200.1:235
icmp 209.165.200.230:236192.168.1.3:236    209.165.200.1:236  209.165.200.1:236
```

Отправка непрерывных эхо-запросов с PC-A и PC-B на Lo 1 R1.

```
R1#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 209.165.200.230:226192.168.1.2:226    209.165.200.1:226  209.165.200.1:226
icmp 209.165.200.230:227192.168.1.2:227    209.165.200.1:227  209.165.200.1:227
icmp 209.165.200.230:228192.168.1.2:228    209.165.200.1:228  209.165.200.1:228
icmp 209.165.200.230:229192.168.1.2:229    209.165.200.1:229  209.165.200.1:229
icmp 209.165.200.230:230192.168.1.2:230    209.165.200.1:230  209.165.200.1:230
icmp 209.165.200.230:231192.168.1.2:231    209.165.200.1:231  209.165.200.1:231
icmp 209.165.200.230:232192.168.1.2:232    209.165.200.1:232  209.165.200.1:232
icmp 209.165.200.230:233192.168.1.2:233    209.165.200.1:233  209.165.200.1:233
icmp 209.165.200.230:237192.168.1.3:237    209.165.200.1:237  209.165.200.1:237
icmp 209.165.200.230:238192.168.1.3:238    209.165.200.1:238  209.165.200.1:238
icmp 209.165.200.230:239192.168.1.3:239    209.165.200.1:239  209.165.200.1:239
icmp 209.165.200.230:240192.168.1.3:240    209.165.200.1:240  209.165.200.1:240
icmp 209.165.200.230:241192.168.1.3:241    209.165.200.1:241  209.165.200.1:241
icmp 209.165.200.230:242192.168.1.3:242    209.165.200.1:242  209.165.200.1:242
icmp 209.165.200.230:243192.168.1.3:243    209.165.200.1:243  209.165.200.1:243
icmp 209.165.200.230:244192.168.1.3:244    209.165.200.1:244  209.165.200.1:244
icmp 209.165.200.230:245192.168.1.3:245    209.165.200.1:245  209.165.200.1:245
icmp 209.165.200.230:246192.168.1.3:246    209.165.200.1:246  209.165.200.1:246
icmp 209.165.200.230:247192.168.1.3:247    209.165.200.1:247  209.165.200.1:247
icmp 209.165.200.230:248192.168.1.3:248    209.165.200.1:248  209.165.200.1:248
icmp 209.165.200.230:249192.168.1.3:249    209.165.200.1:249  209.165.200.1:249
icmp 209.165.200.230:250192.168.1.3:250    209.165.200.1:250  209.165.200.1:250
icmp 209.165.200.230:251192.168.1.3:251    209.165.200.1:251  209.165.200.1:251
icmp 209.165.200.230:252192.168.1.3:252    209.165.200.1:252  209.165.200.1:252
icmp 209.165.200.230:253192.168.1.3:253    209.165.200.1:253  209.165.200.1:253
icmp 209.165.200.230:254192.168.1.3:254    209.165.200.1:254  209.165.200.1:254
icmp 209.165.200.230:255192.168.1.3:255    209.165.200.1:255  209.165.200.1:255
```

## Настройка и проверка статического NAT для IPv4.

### На R1 очищены текущие трансляции и статистика.

```
R1# clear ip nat translation * 
R1# clear ip nat statistic 
```

### На R1 настроен NAT, необходимый для статического сопоставления внутреннего адреса с внешним адресом.

```
R1(config)# ip nat inside source static 192.168.1.2 209.165.200.229 
```

### Тестирование и проверка конфигурации.

Проверка, что статический NAT работает. На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.

```
R1#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
---  209.165.200.229   192.168.1.2        ---                ---
```

Выполнен ping с R2 на 209.165.200.229. 

```
R2#ping 209.165.200.229

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 209.165.200.229, timeout is 2 seconds:
..!!!
Success rate is 60 percent (3/5), round-trip min/avg/max = 0/0/1 ms
```

На R1 отображена таблица NAT на R1 с помощью команды show ip nat translations.