# Базовая настройка коммутатора

## Исходные данные
### Топология

![Топология](./Pic_1.png "Топология")

### Таблица адресации

| Устройство | Интерфейс | IP-адрес / префикс |
|------------|-----------|--------------------|
| S1         | VLAN1     | 192.168.1.2 / 24   |
| PC-A       | NIC       | 192.168.1.10 / 24  |


## Часть 1. Проверка конфигурации коммутатора по умолчанию

| Параметр                      | Значение                        |
|-------------------------------|---------------------------------|
| running config                | по умолчанию                    |
| Интерфейсов FastEthernet      | 24                              |
| Интерфейсов GigabitEthernet   | 2                               |
| IP-адрес интерфейса SVI       | отсутствует                     |
| MAC-адрес интерфейса SVI      | 00D0FF12E841                    |
| Состояние интерфейса SVI      | выключен                        |
| Версия ОС Cisco IOS           | 15.0(2)SE4 релиз fc1            |
| Файл образа системы           | 2960-lanbasek9-mz.150-2.SE4.bin |
| Базовый MAC-адрес коммутатора | 00D0FF12E841                    |

Рассмотрим свойства интерфейса FastEthernet 0/6, назначенные по умолчанию.
![Свойства порта FastEthernet 0/6](./Pic_2.png)
Интерфейс изначально находится в выключенном состоянии и включается при подключении к нему компьютера.
MAC-адрес интерфейса 0050.0fd6.2c06.
Интерфейс работает в полном дуплексе со скоростью 100Мб/с.

Рассмотрим параметры VLAN 1.
| Параметр            | Значение          |
|---------------------|-------------------|
| Имя                 | default           |
| Порты в сети VLAN 1 | fa0/1-24, gi0/1-2 |
| Статус сети         | активна           |
| Тип сети            | нетегированная    |

## Часть 2. Настройка базовых параметров сетевых устройств
### Настройка параметров коммутатора
Перейдем в режим глобальной конфигурации и выполним настройку базовых параметров.
```
Switch> enable
Switch# conf t
Switch(config)# no ip domain-lookup //отключаем разрешение имен в терминале
Switch(config)# hostname S1 //назначаем имя коммутатору
S1(config)# service password-encryption //включаем шифрование паролей
S1(config)# enable secret class //назначаем пароль для административного режима
S1(config)# banner motd "Unauthorized access is strictly prohibited" //Задаем банер, который будет отображаться при входе
```
Назначим ip-адрес для удаленного управления коммутатором.
```
S1(config)# int vlan 1
S1(config-if)# ip address 192.168.1.2 255.255.255.0 //назначаем ip-адрес и маску
S1(config-if)# no shutdown //включаем интерфейс
S1(config-if)# exit
```
Ограничим доступ к консоли с помощью пароля.
```
S1(config)# line console 0
S1(config-line)# logging synchronous //изменяем режим вывода консольных сообщений
S1(config-line)# password cisco //назначаем пароль для доступа к консоли
S1(config-line)# login //включаем запрос пароля при входе
S1(config-line)# end
```
Ограничим доступ к vty0-15 с помощью пароля.
```
S1(config)# line vty 0 15
S1(config-line)# password cisco //назначаем пароль для доступа
S1(config-line)# login //включаем запрос пароля при входе
S1(config-line)# end
```
### Настройка параметров компьютера
![Настройка сетевых параметров компьютера](./Pic_3.png "Настройка сетевых параметров компьютера")